public class Info {

    public final static String TEXT_HELP =
            "СПРАВОЧНАЯ ИНФОРМАЦИЯ:\n\n" +
                    "    Для начала использования программы, следует заполнить обязательные поля:\n" +
                            "1. Отправителя;\n" +
                            "2. Получателя;\n" +
                            "3. Начало сообщения;\n" +
                            "4. Середину сообщения;\n" +
                            "5. Конец сообщения;\n" +
                    "\n" +
                    "    Поле \"Отправитель\" заполняется в Иминительном падеже, 1 раз. Поле \"Получатель\" заполняется " +
                    "для каждого получателя, так же, в Иминительном падеже.\n" +
                    "\n" +
                    "Образец заполнения полей сообщения:\n" +
                    "Дорогой name, \n" +
                    "\n" +
                    "ПРИМЕЧАНИЕ! Для корректного добавления имени получателя в текст, его стоит добавлять как \"name\" , " +
                    "без кавычек. К тому же, нужно учитывать, что склоняться в этой версии программы оно не будет!" +
                    "\nПРИМЕЧАНИЕ! Программа пока не различает половую принадлежность, поэтому стоит либо писать текст," +
                    "избегая подобные моменты, либо оставить как есть. В любом случае, позже текст можно будет подправить.\n" +
                    "\n" +
                    "    После заполнения всех необходимых полей, для сохранения результата требуется нажать кнопку \"Запомнить\"." +
                    "Программа запомнит ваш оригинал поздравления до момента закрытия приложения под индексом, " +
                    "Находящемся между стрелками и сразу создаст поля для нового получателя.\n" +
                    "    В данной версии программы можно заполнять от 3 до 18 получателей. К тексту каждого можно " +
                    "перемещаться при помощи стрелок в окне приложения, по индексам.\n" +
                    "\n" +
                    "    Для редактирования оригинального теста, следует сначала выбрать нужного, при помощи стрелок " +
                    "приложения, отредактировать в полях сообщений и после, нажать кнопку\"Исправить\"\n" +
                    "\n" +
                    "    После того, как все получатели будут заполнены, для генерации \"испорченных\" сообщений, требуется " +
                    "нажать на кнопку \"Перемешать\". В результате оригиналы поздравления останутся прежними, но для " +
                    "каждого получателя, на дисплее программы, будет отображаться сгенерированное поздравление, " +
                    "текст которого можно скопировать. К сожалению, в данной версии программы не реализована отправка, " +
                    "но скопированный текст можно вставить в любое другое приложение, в т.ч. в письмо, либо мессенджер " +
                    "для отправки.\n" +
                    "\n" +
                    "    Так же, есть кнопка \"Перемешать\", которая позволяет оригинальный текст для получателя.\n" +
                    "\n" +
                    "Для выхода из программы, можно нажать либо красный крестик, в верхнем правом углу программы, " +
                    "либо на пункт \"Меню\", затем \"Выход\"\n"
            ;

    public final static String TEXT_ABOUT_PROGRAM =
            "О ПРОГРАММЕ:\n\n" +
                    "    Автор: a3d.me\n" +
                    "    Версия программы: v1.1\n" +
                    "    e-mail: info@a3d.me\n"

            ;

}
